MicrochipTech/dspic33a-high-speed-adc-example/capture.c
/* A burst is in flight from here until the DMA DONE interrupt. */
static void start_burst(void)
{
    burst_active = true;
    {
        adc_start_burst();
    }
}

/* ------------------------------------------------------------------ *
 * Set-up: the DMA channel, wired to this ADC core and this buffer
 * ------------------------------------------------------------------ */
/* The guard words sit right behind the region in use: the struct's own
 * guard when the whole array is used, otherwise the words of the array
 * that follow the used region (a DMA writing one transaction too many
 * hits them first either way). 16 words = 8 samples' worth of 32-bit
 * words = 32 samples; the minimum half length keeps room for them. */
static volatile uint32_t *guard_word(uint32_t i)
{
    const uint32_t used = 2u * half_len;
    if (used + 2u * BUF_GUARD_WORDS <= SAMPLES_PER_BUF_MAX) {
        return (volatile uint32_t *)&dma_buffer.data[used] + i;
    }
    return &dma_buffer.guard[i];
}

void capture_init(void)
{
    for (uint32_t i = 0; i < BUF_GUARD_WORDS; i++) {
        dma_buffer.guard[i] = BUF_GUARD_PATTERN(i);
        *guard_word(i)      = BUF_GUARD_PATTERN(i);
    }
    /* Burst length and DMA block are the same number, set here from the
     * length in use: 2 * half_len conversions per burst, 2 * half_len
     * transactions per block, both re-done before every start. */
    adc_set_burst_len(2u * half_len);
    dma0_init(adc_dma_trigger(), adc_dma_source(), dma_buffer.data, 2u * half_len * sizeof(uint16_t));
    dma_armed = true;
}
_Static_assert(sizeof dma_buffer.data == SAMPLES_PER_BUF_MAX * sizeof(uint16_t),
               "buffer allocation and its maximum must be the same thing");

uint32_t capture_half_len(void) { return half_len; }

bool capture_set_half_len(uint32_t n)
{
    if ((n < SAMPLES_PER_HALF_MIN) || (n > SAMPLES_PER_HALF_MAX)) { return false; }
    if (run_enabled || burst_active) { return false; }      /* stop first */
    (void)capture_settle();           /* DMA down; the next start re-inits */
    half_len = n;
    return true;
}

/* Stop with code 11 if anything wrote past the end of the buffer. */
static void guard_check(void)
{
    for (uint32_t i = 0; i < BUF_GUARD_WORDS; i++) {
        if (*guard_word(i) != BUF_GUARD_PATTERN(i)) {
            console_kv("[guard] word behind the buffer changed, index", i);
            console_kv_hex("[guard] value", *guard_word(i));
            console_kv_hex("[guard] expected", BUF_GUARD_PATTERN(i));
            fail(11u);
        }
    }
}

/* Switch the stream off hard, so that a 40 MSPS stream does not keep
 * hammering the bus while fail() or a trap handler prints. */
void capture_halt(void)
{
    dma0_halt();
}

/* ------------------------------------------------------------------ *
 * DMA event - one per buffer half, called from the DMA0 interrupt
 *
 * HALF: the first half is complete, the DMA is filling the second.
 * DONE: the second half is complete, the DMA has reloaded to the start
 *       and the ADC burst has ended - apply a pending input change and,
 *       if the stream is enabled, start the next burst here.
 *
 * Runs in the interrupt, priority 4 (IPC9 default). The console's UART
 * receive interrupt runs at priority 1, so this preempts a running
 * command.
 *
 * Deliberately short. Everything this counts is a hardware flag, so a
 * long handler would itself become the reason for the next overrun.
 * ------------------------------------------------------------------ */
void dma0_event(uint32_t st)
{
    if (st & DMA0_OVERRUN) {
        /* Triggered while the previous transfer was still in progress
         * (p816): the bus did not keep up. This is the measurement. */
        dma_overrun++;
        dma0_clear(DMA0_OVERRUN);
        if (dma_overrun >= OVERRUN_LIMIT) {
            /* The brake (see OVERRUN_LIMIT above). Masking the interrupt
             * and disabling the channel here, from inside the storm, is
             * what gives the main loop the CPU back. */
            dma0_halt();              /* IEC2.DMA0IE = 0, CHEN = 0      */
            run_enabled   = false;
            burst_active  = false;
            overrun_abort = true;
            return;
        }
    }
    if (st & DMA0_ADRERR) {
        dma_addr_err++;
        dma0_clear(DMA0_ADRERR);
    }
    if (st & (DMA0_BRERR | DMA0_BWERR)) {
        dma_bus_err++;
        dma0_clear(DMA0_BRERR | DMA0_BWERR);
    }

    /* Both halves pending at once means this handler arrived more than
     * one half (25.6 us) late and the first half has already been
     * overwritten by the DMA reload. */
    if ((st & DMA0_HALF) && (st & DMA0_DONE)) {
        late_service++;
    }

    if (st & DMA0_HALF) {
        dma0_clear(DMA0_HALF);
        ready_half  = 0u;
        last_sample = buf[half_len - 1u];
        blocks_done++;
    }
    if (st & DMA0_DONE) {
        dma0_clear(DMA0_DONE);
        ready_half  = 1u;
        last_sample = buf[2u * half_len - 1u];
        blocks_done++;

        /* The channel is idle between bursts: this is the only safe
         * moment to change its input or sample time. */
        if (switch_pending) {
            adc_set_input(pinsel_next, samc_next);
            switch_pending = false;
        }
        if (run_enabled) {
            start_burst();            /* next 2 * half_len samples      */
        } else {
            burst_active = false;
        }
    }
}

/* ------------------------------------------------------------------ *
 * Control API (capture.h)
 * ------------------------------------------------------------------ */
void capture_start(void)
{
    if (!powered) {
        /* After capture_shutdown(): clock first, then the core - the boot
         * order. Registers kept their values, so the divide ratio is
         * what they were. A wait that runs out is reported and the
         * start refused; the counters show nothing moving. */
        const bool clk = clock_adc_on();
        const bool adc = adc_reinit();
        if (!clk || !adc) {
            console_puts(clk ? "[capture] ADC core did not come back (ADRDY)\r\n"
                             : "[capture] CLKGEN6 did not come back (CLKRDY)\r\n");
            return;
        }
        powered = true;
    }
    if (!dma_armed) {
        capture_init();               /* fresh DMA set-up for this run  */
    }
    run_enabled = true;
    if (!burst_active) {
        start_burst();
    }
}

void capture_shutdown(void)
{
    (void)quiesce();                  /* stream off, burst finished     */
    adc_deinit();
    clock_adc_off();
    powered = false;
}

