MicrochipTech/dspic33a-high-speed-adc-example/capture.c
bool capture_powered(void)
{
    return powered;
}

bool capture_select_core(uint8_t core, uint8_t pinsel, uint8_t samc)
{
    if ((core < 1u) || (core > 5u)) { return false; }
    (void)quiesce();
    if (powered) { adc_deinit(); }
    else         { (void)clock_adc_on(); }   /* the new core needs its clock */
    (void)adc_select(core);
    adc_init(pinsel, samc);                  /* core on, ADRDY, or fail(5) */
    capture_init();                          /* DMA on this core's trigger */
    switch_pending = false;
    pinsel_next    = pinsel;
    samc_next      = samc;
    powered        = true;
    burst_active   = false;
    counters_clear();
    return true;
}

void capture_stop(void)
{
    run_enabled = false;
}

bool capture_running(void)
{
    return run_enabled;
}

bool capture_overrun_aborted(void)
{
    return overrun_abort;
}

bool capture_burst_active(void)
{
    return burst_active;
}

bool capture_set_input(uint8_t pinsel, uint8_t samc)
{
    if ((pinsel > 15u) || (samc > 31u)) {
        return false;
    }
    pinsel_next = pinsel;
    samc_next   = samc;
    switch_pending = true;
    if (!burst_active) {
        /* Nothing running: apply right away, the channel is idle. */
        adc_set_input(pinsel, samc);
        switch_pending = false;
    }
    return true;
}

uint8_t capture_pinsel(void) { return adc_pinsel(); }
uint8_t capture_samc(void)   { return adc_samc(); }

/* ------------------------------------------------------------------ *
 * The ADC clock - the only rate control there is (capture.h)
 *
 * The conversions run back-to-back, so the sample rate is the ADC clock
 * divided by the eight clocks one conversion takes: 320 MHz undivided =
 * 40 MSPS. CLKGEN6's divider is therefore the rate knob, and the ladder
 * below is walked from the slowest rate to the fastest on purpose. The
 * slowest point is the one the DMA should manage comfortably, so the
 * first row of a sweep is the row most likely to pass - and a failure
 * there means the chain is broken, not the rate.
 *
 * Integer and fractional ratios alternate deliberately. 2.5 sits exactly
 * between 2 and 3, and 4.5 between 4 and 5: if those rows land halfway
 * between their neighbours, FRACDIV works; if they snap to a neighbour,
 * the fractional field is ignored and only INTDIV counts. Nothing else
 * in the log answers that question.
 *
 * There is a gap between 20 and 40 MSPS and it is not an oversight: the
 * datasheet says FRACDIV does nothing while INTDIV is 0 (12.4.2 4b),
 * so no ratio between 1 and 2 can be realised at all. 20 MSPS is the
 * fastest divided rate; the next step up is the undivided clock.
 *
 * 500 = 8 MSPS is the rate the customer's application needs; it is in
 * the ladder for that reason and for no other.
 * ------------------------------------------------------------------ */
static const uint32_t sweep_ratios[] = {
    1000u,  /* /10   32.0 MHz   4.00 MSPS  slowest the ADC may run       */
     900u,  /* /9    35.6 MHz   4.44 MSPS  INTDIV 4, FRACDIV 256         */
     800u,  /* /8    40.0 MHz   5.00 MSPS                                */
     700u,  /* /7    45.7 MHz   5.71 MSPS  INTDIV 3, FRACDIV 256         */
     600u,  /* /6    53.3 MHz   6.67 MSPS                                */
     500u,  /* /5    64.0 MHz   8.00 MSPS  the customer's floor          */
     450u,  /* /4.5  71.1 MHz   8.89 MSPS  INTDIV 2, FRACDIV 128         */
     400u,  /* /4    80.0 MHz  10.00 MSPS                                */
     350u,  /* /3.5  91.4 MHz  11.43 MSPS  INTDIV 1, FRACDIV 384         */
     300u,  /* /3   106.7 MHz  13.33 MSPS  INTDIV 1, FRACDIV 256         */
     250u,  /* /2.5 128.0 MHz  16.00 MSPS  INTDIV 1, FRACDIV 128         */
     200u,  /* /2   160.0 MHz  20.00 MSPS  INTDIV 1, FRACDIV 0 - the
             *      fastest the divider can do: anything between this and
             *      undivided would need INTDIV 0, and FRACDIV does not
             *      work then (12.4.2 4b)                                */
     100u   /* /1   320.0 MHz  40.00 MSPS  undivided, both fields 0      */
};


uint32_t capture_set_clkdiv(uint32_t ratio_h)
{
    /* The order the user asked for, and it is the boot order run
     * backwards and forwards again: DMA channel down and ADC core off
     * (capture_settle, adc_deinit), CLKGEN6 off, divider written, read
     * back, generator on, DIVSWEN and CLKRDY awaited, fields read back
     * once more (clock_adc_set_div), core on and ADRDY awaited
     * (adc_reinit), DMA set up from scratch on the next capture_start().
     * Nothing is reconfigured under a running clock or a running core. */
    const bool restart = capture_settle();      /* DMA down, burst ended */
    adc_deinit();                               /* core off              */
    const uint32_t rc    = clock_adc_set_div(ratio_h);
    const bool     ready = adc_reinit();        /* core on, ADRDY        */
    if (rc == CLKDIV_OK) { clkdiv_cur = ratio_h; }
    if (restart) { capture_start(); }           /* dma0_init() again     */
    if (rc != CLKDIV_OK) { return rc; }
    return ready ? CLKDIV_OK : CLKDIV_ADC;
}

uint32_t capture_clkdiv(void)        { return clock_adc_div(); }  /* hardware */
uint32_t capture_clkdiv_wanted(void) { return clkdiv_cur; }       /* asked for */

uint32_t capture_nominal_ksps(uint32_t ratio_h)
{
    /* 40 MSPS at ratio 1, and the ratio is in hundredths:
     * 40 000 ksps * 100 / ratio_h. */
    return (ratio_h == 0u) ? 0u : (4000000u / ratio_h);
}

const uint32_t *capture_sweep_ratios(uint32_t *count)
{
    *count = sizeof sweep_ratios / sizeof sweep_ratios[0];
    return sweep_ratios;
}

const volatile uint16_t *capture_completed_half(void)
{
    return &buf[ready_half ? half_len : 0u];
}

void counters_clear(void)
{
    overrun_abort = false;            /* re-arm the brake               */
    dma_overrun = 0; dma_addr_err = 0; dma_bus_err = 0;
    late_service = 0; proc_missed = 0;
    /* Halves completed up to now are not "missed" from here on. Without
     * this the first capture_service() after the self-test books its
     * 12 unserviced halves as proc_missed, and the heartbeat goes to the
     * error rate before the measurement has even started. */
    seen_blocks = blocks_done;
}

/* ------------------------------------------------------------------ *
 * Process one completed buffer half
 *
 * Placeholder for the customer's "+ and -" arithmetic. Written as a
 * plain accumulate so the cost of touching every sample is visible in
 * the measurement: at 40 MSPS this loop sees 40 million values per
 * second and per channel, and whether the CPU keeps up is as much a
 * question as the DMA bandwidth.
 * ------------------------------------------------------------------ */
static void process_buffer(const volatile uint16_t *b, uint32_t n)
{
    int32_t acc = 0;
    for (uint32_t i = 0; i < n; i++) {
        acc += (int32_t)b[i];
    }
    proc_result = acc;
    SIM_CHECK_HALF(b, n);             /* simulator: is this really the next half? */
}

static uint32_t half_mean(const volatile uint16_t *b, uint32_t n)
{
    uint32_t acc = 0;
    for (uint32_t i = 0; i < n; i++) {
        acc += b[i];
    }
    return acc / n;
}

bool capture_service(void)
{
    const uint32_t done = blocks_done;
    if (done == seen_blocks) {
        return false;
    }
    if ((done - seen_blocks) > 1u) {
        proc_missed += (done - seen_blocks) - 1u;
    }
    seen_blocks = done;
    process_buffer(capture_completed_half(), half_len);
    guard_check();                    /* did the DMA stay inside buf?    */

